"""
5.	Вывести на экран коды и символы таблицы ASCII, начиная с символа
под номером 32 и заканчивая 127-м включительно.
Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.
"""

k = 0
    
for i in range(32,127+1):
    k = k + 1
    print (chr(i), end = " ")
    if k % 10 == 0:
        print ('\n')

print ('\n 32 элемент - ',chr(32))
 
print ('\n 127 элемент - ',chr(127))
#===========================================================================
    # if int(number2[i]) % 2 == 0:
    #     chet += 1
    # else:
    #     nechet += 1        
    #===========================================================================
#print('Четное =', chet)