# 1.	В диапазоне натуральных чисел от 2 до 99 определить,
# сколько из них кратны каждому из чисел в диапазоне от 2 до 9.

my_set = [[]]

for i in range (2, 90):
    my_set.append([])
    for k in range (2, 9):
        m = 0
        if i % k == 0:        
            m = i / k
    
        my_set[i-2].append(int(m))


print (my_set)

#===============================================================================
# 
# for i in range (0, 90):
#     my_set.append([])
#     m = 0
#     for k in range (1, 9):
#         if i % k == 0:
#             my_set.insert([i][k], 10)
#     
#             
# print (my_set)
#===============================================================================